app/controllers/games_controller.rb

SELECT "games".* FROM "games"
---
  def index
    @games = Game.all

SELECT  "games".* FROM "games"  WHERE "games"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @game = Game.find(params[:id])

INSERT INTO "games" ("computer_throw", "created_at", "updated_at", "user_throw", "winner") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["computer_throw", "paper-plane"], ["created_at", "2014-10-20 01:51:58.557602"], ["updated_at", "2014-10-20 01:51:58.557602"], ["user_throw", "scissors"], ["winner", "user"]]
---
  def create
    @game = Game.new(game_params)

    if @game.save